Repository: common-repository/webpoint-login
Catalog: languages/webpoint-login-*.po
Languages: ru_ru

source: You are logged out. Do you want to log in again?
ru_ru: Вы вышли из системы. Хотите авторизоваться на сайте снова?

source: You have successfully registered on the site %s. Now you can log in using your username and password.
ru_ru: Вы успешно зарегистрировались на сайте %s. Теперь вы можете войти, используя свое имя пользователя и пароль.

source: You have been sent an email with a link to reset your password.
ru_ru: Вам отправлено письмо со ссылкой для сброса пароля.

source: Your password has been changed. You can log in using the new password.
ru_ru: Ваш пароль был изменен. Вы можете войти на сайт, используя новый пароль.

source: Username
ru_ru: Имя пользователя

source: Password
ru_ru: Пароль

source: Remember me
ru_ru: Запомнить меня

source: Log in
ru_ru: Авторизация

source: Forgot your password?
ru_ru: Забыли пароль?

source: Enter your username or email:
ru_ru: Введите ваше имя пользователя или email:

source: Username or email
ru_ru: Имя пользователя или email

source: Submit
ru_ru: Отправить

source: Enter a new password
ru_ru: Введите новый пароль

source: Confirm password
ru_ru: Повторите пароль

source: To create a strong password, use uppercase and lowercase letters, numbers and symbols like ! " ? $ % ^ & ).
ru_ru: Чтобы создать надежный пароль, используйте большие и маленькие буквы, числа и символы наподобие ! " ? $ % ^ & ).

source: Required fields
ru_ru: поля, обязательные для заполнения

source: Save
ru_ru: Сохранить

source: Sign up
ru_ru: Регистрация

source: Password reset
ru_ru: Сброс пароля

source: You do not have sufficient permissions to access this page.
ru_ru: У вас недостаточно прав для доступа к этой странице.

source: WebPoint Login Settings
ru_ru: Настройки WebPoint Login

source: Enter the Google reCAPTCHA Site Key.
ru_ru: Введите публичный ключ сайта Google reCAPTCHA.

source: Enter the Google reCAPTCHA Secret Key.
ru_ru: Введите секретный ключ сайта Google reCAPTCHA.

source: reCAPTCHA Error. Check the box "I'm not a robot" and try again.
ru_ru: Вы не прошли защиту от роботов Google reCAPTCHA. Установите флажок «Я не робот» и повторите попытку.

source: User registration is disabled.
ru_ru: Регистрация пользователей отключена.

source: To restore access to your account, click on the %slink%s.
ru_ru: Для восстановления доступа к аккаунту, перейдите по %sссылке%s.

source: Google reCAPTCHA Loading Error.
ru_ru: Ошибка загрузки Google reCAPTCHA.

source: Check the box "I'm not a robot" and try again.
ru_ru: Установите флажок «Я не робот» и повторите попытку.

source: Enter password
ru_ru: Введите пароль

source: Passwords do not match!
ru_ru: Пароли не совпадают!

source: Passwords match
ru_ru: Пароли совпадают

source: Password is too short
ru_ru: Пароль слишком короткий

# password
source: Weak!
ru_ru: Пароль слишком простой

# password
source: Average!
ru_ru: Пароль средней сложности

# password
source: Strong!
ru_ru: Надежный пароль

# password
source: Secure!
ru_ru: Надежный пароль

source: Username may not be longer than 60 characters.
ru_ru: Имя пользователя не может быть длиннее 60 символов.

source: Username should not start with a number.
ru_ru: Имя пользователя не должно начинаться с числа.

source: Username should not start with a hyphen.
ru_ru: Имя пользователя не должно начинаться с дефиса.

source: Username should not start with an underscore.
ru_ru: Имя пользователя не должно начинаться с нижнего подчеркивания.

source: Username should not contain uppercase letters.
ru_ru: Имя пользователя не должно содержать большие буквы.

source: Username should not end with a hyphen.
ru_ru: Имя пользователя не должно заканчиваться дефисом.

source: Username should not end with underscore.
ru_ru: Имя пользователя не должно заканчиваться нижним подчеркиванием.

source: Username should not contain double hyphens.
ru_ru: Имя пользователя не должно содержать двойные дефисы.

source: Username should not contain double underscores.
ru_ru: Имя пользователя не должно содержать двойные нижние подчеркивания.

source: Username should not contain underscore after the hyphen.
ru_ru: Имя пользователя не должно содержать нижнее подчеркивание, идущее сразу после дефиса.

source: Username should not contain hyphen after the underscore.
ru_ru: Имя пользователя не должно содержать дефис, идущий сразу после нижнего подчеркивания.

# js login error
source: Invalid username
ru_ru: Недопустимое имя пользователя

source: Username can contain lowercase letters of the Latin alphabet (a-z), numbers (0-9), single hyphens (-) and underscores (_). It should start with a letter, end with a letter or number and may not be longer than 60 characters.
ru_ru: Имя пользователя может содержать маленькие буквы латинского алфавита (a–z), цифры (0–9), одиночные дефисы (-) и символы подчеркивания (_). Оно должно начинаться с буквы, заканчиваться буквой или цифрой и содержать не более 60 символов.

source: Email address cannot be empty.
ru_ru: Адрес электронной почты не может быть пустым.

source: Incorrect email address.
ru_ru: Неверный адрес электронной почты.

source: Username cannot be empty.
ru_ru: Имя пользователя не может быть пустым.

source: Template file does not set!
ru_ru: Файл шаблона не установлен!

source: Template file does not exist!
ru_ru: Файл шаблона не существует!

source: Hello!
ru_ru: Здравствуйте!

source: Someone has requested a password reset for the following account: %s
ru_ru: Кто-то запросил сброс пароля для следующей учётной записи: %s

source: If this was a mistake, just ignore this email and nothing will happen.
ru_ru: Если произошла ошибка, просто проигнорируйте это письмо, и ничего не произойдёт.

source: To reset your password, visit the following address:
ru_ru: Чтобы создать новый пароль, перейдите по следующей ссылке:

source: Sincerely, Administration %s
ru_ru: С уважением, Администрация сайта %s

source: Registration on the site %s
ru_ru: Регистрация на сайте %s

source: You have successfully registered on the site %s
ru_ru: Вы зарегистрировались на сайте %s

source: Now you can %slog in%s using your username and password.
ru_ru: Теперь вы можете %sвойти%s, используя свое имя пользователя и пароль.

source: Loading Google reCAPTCHA
ru_ru: Загрузка Google reCAPTCHA

source: You are already authorized on the site. Go to the %scontrol panel%s.
ru_ru: Вы уже авторизованы на сайте. Перейти в %sпанель управления%s.

source: Unknown error. Notify the administrator and try again later.
ru_ru: Неизвестная ошибка. Сообщите администратору и повторите попытку позже.

source: Request error. Please refresh the page and try again.
ru_ru: Ошибка передачи данных. Пожалуйста, обновите страницу и попробуйте еще раз.

source: Invalid username.
ru_ru: Неверное имя пользователя.

source: Incorrect password. %sForgot your password?%s
ru_ru: Неверный пароль. %sЗабыли пароль?%s

source: Password cannot be empty.
ru_ru: Пароль не может быть пустым.

source: Username already exists.
ru_ru: Пользователь с таким логином уже существует.

source: Email already exists.
ru_ru: Пользователь с таким email уже существует.

source: Username must be between 1 and 60 characters.
ru_ru: Имя пользователя должно содержать от 1 до 60 символов.

source: Email address should not contain more than 100 characters.
ru_ru: Адрес электронной почты должен содержать не более 100 символов.

source: Password must be between 8 and 64 characters.
ru_ru: Пароль должен содержать от 8 до 64 символов.

source: Passwords do not match.
ru_ru: Пароли не совпадают.

source: Registration error. Please refresh the page and try again.
ru_ru: Ошибка регистрации. Пожалуйста, обновите страницу и попробуйте еще раз.

source: Invalid password reset link. %sRequest a new link?%s
ru_ru: Недействительная ссылка сброса пароля. %sЗапросить новую ссылку?%s

source: Incorrect username or email.
ru_ru: Неверное имя пользователя или email.

source: Authorization, registration and password reset with protection from robots.
ru_ru: Авторизация, регистрация и сброс пароля с защитой от роботов.

source: Dmitriy Denisov
ru_ru: Дмитрий Денисов
